<a href="https://colab.research.google.com/github/Avishek2020/Python-Crash-Course/blob/master/Merge_Data_Frames_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as pd
import numpy as np

#### Pandas Merge data Frame

`Reference https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html`

In [10]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
   ...:             'B': ['B0', 'B1', 'B2', 'B3'],
   ...:             'C': ['C0', 'C1', 'C2', 'C3'],
   ...:             'D': ['D0', 'D1', 'D2', 'D3']},
   ...:                    index=[0, 1, 2, 3])
   ...: 

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
   ...:             'B': ['B4', 'B5', 'B6', 'B7'],
   ...:             'C': ['C4', 'C5', 'C6', 'C7'],
   ...:             'D': ['D4', 'D5', 'D6', 'D7']},
   ...:                    index=[4, 5, 6, 7])
   ...: 

print("DataFrame output df1 with different indexes : 0,1,2,3 ")
df1

DataFrame output df1 with different indexes : 0,1,2,3

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [11]:
print("DataFrame output df2 with different indexes : 4,5,6,7 ")
df2

DataFrame output df2 with different indexes : 4,5,6,7

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

`The concat() function (in the main pandas namespace) does all of the heavy lifting of performing concatenation operations along an axis while performing optional set logic (union or intersection) of the indexes (if any) on the other axes. 

- note axis =0 index wise concatenation`

In [16]:
frames = [df1, df2]
result = pd.concat(frames, axis=0)
result

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

`- note axis = 1 columnwise concatenation`

---

In [17]:
frames = [df1, df2]
result = pd.concat(frames, axis=1)
result

     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7



`
 But you can see columnwise concatention output is not so correct. \
 we can fix with with reset index command below given
`

In [18]:
df1.reset_index(inplace=True, drop= True)
df2.reset_index(inplace=True, drop= True)

In [19]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [20]:
df2

    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7



`
This is desired output results
`

In [21]:
result2 = pd.concat([df1, df2],  axis=1)
result2

    A   B   C   D   A   B   C   D
0  A0  B0  C0  D0  A4  B4  C4  D4
1  A1  B1  C1  D1  A5  B5  C5  D5
2  A2  B2  C2  D2  A6  B6  C6  D6
3  A3  B3  C3  D3  A7  B7  C7  D7